sub napums{
my($in)=@_; 
 if($in=~/"noun_n"/) {
  if(&sarvAxi($in)){
      if(($in=~/[ÏÖ]/) && ($in !~ /[Ñ¸¹º»¼½¾¿ÀÁÂÃÄÅÆÕ×]/)){
         $in=$in.',"'."³ÂÏ".'"';
      } else {
         $in=$in.'"'."³ÂÌ".'"';
      }
  }
   if($in=~/"ÕèÏÜÈÚ"/){
      $in=$in.',"'."ÕèÏÜÈÚ".'"';
    }elsif($in=~/ÈÚ"/){
      $in=$in.',"'."ÕèÏÜÈÚ".'"';
  }elsif($in=~/Û"/){
      if(($in=~/[ÏÖ]/) && ($in !~ /[Ñ¸¹º»¼½¾¿ÀÁÂÃÄÅÆÕ×]/)){
         $in=$in.',"'."ÔÚÏÛ".'"';
      }
      else { $in=$in.',"'."ÄÅÛ".'"'; }
  }
  if($in=~/Ü"/){
      $in=$in.',"'."×İÅÜ".'"';
  }elsif($in=~/"¤ÆèÍÂÌ"/){
      $in=$in.',"'."¤ÆèÍÂÌ".'"';
  }elsif($in=~/"¬³ÂÏ"/){
      $in=$in.',"'."¬³ÂÏ".'"';
  }elsif($in=~/"×İÑİ"/){
      $in=$in.',"'."×İÑİ".'"';
  }elsif($in=~/İ"/){
      $in=$in.',"'."ÌÅİ".'"';
  }elsif($in=~/ß"/){
      $in=$in.',"'."ÅÚÂß".'"';
  }elsif($in=~/å"/){
      $in=$in.',"'."ÈèÏÄèÍå".'"';
  }elsif($in=~/â"/){
      $in=$in.',"'."ÈèÏÏâ".'"';
  }elsif($in=~/æ"/){
      $in=$in.',"'."×İÆæ".'"';
  }
  if($in =~ /[³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÈÉÊËÌÍÏÑÔÕÖ×Ø]"/) {
      if(($in=~/[ÏÖ]/) && ($in !~ /[Ñ¸¹º»¼½¾¿ÀÁÂÃÄÅÆÕ×]/)){
        $in=$in.',"'."ÈİÖèÈ".'"';
      }
     else 
      { 
        $in=$in.',"'."ºè¼ÚÆ".'"'; 
      }
  }
  if($in=~/×èÔÆ¿İØè"/){
      $in=$in.',"'."×èÔÆ¿İØè".'"';
  }elsif($in=~/"¸ÂİÏè"/){
      $in=$in.',"'."¸ÂİÏè".'"';
  }elsif($in=~/Ïè"/){
      $in=$in.',"'."ÔÚÏè".'"';
  }elsif($in=~/"³ÛÌè"/){
      $in=$in.',"'."³ÛÌè".'"';
  }elsif($in=~/"¦ÄÌè"/){
      $in=$in.',"'."¦ÄÌè".'"';
  }elsif($in=~/"ÄÁè¿ÛÆè"/){
      $in=$in.',"'."ÄÁè¿ÛÆè".'"';
  }elsif($in=~/ÈÃÛÆè"/){
      $in=$in.',"'."×İÈÃÛÆè".'"';
 }elsif($in=~/"¤ØÆè"/){
      $in=$in.',"'."¤ØÆè".'"';
 }elsif($in=~/Æè"/){
      $in=$in.',"'."¤ØÆè".'"';
 }elsif($in=~/©Ïèºè"/){
      $in=$in.',"'."©Ïèºè".'"';
 }elsif($in=~/ºè"/){
      $in=$in.',"'."©Ïèºè".'"';
  }elsif($in=~/"ÂÄè"/){
      $in=$in.',"'."ÂÄè".'"';
  }elsif($in=~/"ÍÄè"/){
      $in=$in.',"'."ÍÄè".'"';
  }elsif($in=~/"¬ÂÄè"/){
      $in=$in.',"'."¬ÂÄè".'"';
  }elsif($in=~/"µÔÚ¸è"/){
      $in=$in.',"'."µÔÚ¸è".'"';
  }elsif($in=~/³ßÂè"/){
      $in=$in.',"'."Õ³ßÂè".'"';
  }elsif($in=~/ÄÄÂè"/){
      $in=$in.',"'."ÄÄÂè".'"';
  }elsif($in=~/ÄÂè"/){
      $in=$in.',"'."ÂİÄÂè".'"';
  }elsif($in=~/Âè"/){
      $in=$in.',"'."È¸Âè".'"';
  }elsif($in=~/"ÅÆİÖè"/){
      $in=$in.',"'."ÅÆİÖè".'"';
  }elsif($in=~/Öè"/){
      $in=$in.',"'."ÅÆİÖè".'"';
  }elsif($in=~/"¤Ä×è"/){
      $in=$in.',"'."¤Ä×è".'"';
  }elsif($in=~/Ìè×è"/){
      $in=$in.',"'."×İÈİÌè×è".'"';
  }elsif($in=~/×è"/){
      $in=$in.',"'."ÈÍ×è".'"';
  }elsif($in=~/"¦Ä¢"/){
      $in=$in.',"'."¦Ä¢".'"';
 }
print $in,"\n";
} 

if($in=~/"Pronoun"/){
if($in=~/"ÍİÖèÌÄè"/){
      $in=$in.',"'."ÍİÖèÌÄè".'"';
  }elsif($in=~/"¤×èÌÄè"/){
      $in=$in.',"'."¤×èÌÄè".'"';
}
}
print $in,"\n";
}

sub sarvAxi{
my($wrd)=@_;
if($wrd =~ /"×ÏèÔ"/){return 1;}
elsif($wrd =~ /"³ÂÏ"/){return 1;}
elsif($wrd =~ /"³ÂÌ"/){return 1;}
elsif($wrd =~ /"ÔÛÕèÔ"/){return 1;}
elsif($wrd =~ /"¤ÆèÍ"/){return 1;}
elsif($wrd =~ /"¤ÆèÍÂÏ"/){return 1;}
elsif($wrd =~ /"¦ÂÏ"/){return 1;}
elsif($wrd =~ /"ÂèÔ"/){return 1;}
elsif($wrd =~ /"×Ì"/){return 1;}
elsif($wrd =~ /"×ÛÌ"/){return 1;}
else{return 0}
}
1;
